ok2haz/Frequency_Counter_FPGA/Frequency_Counter_STM32H757/CM7/Core/Src/fpga_freq.c
/**
 * @file    fpga_freq.c
 * @brief   SPI2 master driver pro FPGA citac kmitoctu. Viz fpga_freq.h.
 */
#include "fpga_freq.h"
#include "stm32h7xx_hal.h"
#include "cmsis_os2.h"   /* SPI2 mutex: FpgaTask poll vs UART fpgaraw/fpgaloop */
#include <string.h>
#include <stdio.h>

extern SPI_HandleTypeDef hspi2;

/* === CS pin (PB12, drive manualni GPIO, active-low) === */
#define FPGA_CS_GPIO_Port   GPIOB
#define FPGA_CS_Pin         GPIO_PIN_12

/* === SPI rychlost ===
 * Kontrakt FPGA (GW1NR-9, oversampling SCK na 100 MHz): cil <= 6 MHz,
 * absolutni maximum ~10 MHz. NEPREKRACOVAT. */
#define FPGA_SCK_TARGET_HZ  1000000u   /* 1 MHz bring-up */
#define FPGA_SCK_MAX_HZ     10000000u  /* tvrdy strop dle kontraktu */
#if FPGA_SCK_TARGET_HZ > FPGA_SCK_MAX_HZ
#error "FPGA_SCK_TARGET_HZ prekracuje povolene maximum FPGA slave (~10 MHz)"
#endif

/* === Frame === */
#define FR_LEN        64
#define FR_MAGIC      0xA5
#define FR_VERSION    0x01
#define FR_PAYLOAD    12               /* offset payloadu */

/* TYPE */
#define TYPE_ACK      0x06
#define TYPE_START    0x08
#define TYPE_STOP     0x09
#define TYPE_DATA     0x80

/* STATUS/FLAGS bity */
#define ST_DATA_VALID    (1u << 0)
#define ST_DATA_FRESH    (1u << 1)
#define ST_FIFO_EMPTY    (1u << 2)
#define ST_FIFO_OVERFLOW (1u << 3)
#define ST_BUSY          (1u << 4)
#define ST_RX_CRC_ERROR  (1u << 5)
#define ST_ACK_OK        (1u << 6)
#define ST_ERROR         (1u << 7)

static uint32_t g_last_seq = 0xFFFFFFFFu;  /* posledni potvrzena seq */
static uint32_t g_sck_hz   = 0;
static uint8_t  s_link_ok  = 0;            /* 1 = posledni poll dostal platny ramec (MAGIC+CRC) */
static uint32_t g_rx_crc   = 0;            /* pocet ramcu se spatnym CRC */
static uint32_t g_rx_crc_last_ms = 0;      /* HAL_GetTick() pri posledni CRC chybe (0=zadna) -> "uptime od posledni" */
static uint8_t  g_init_ok  = 0;            /* 1 = init+selftest OK, smime komunikovat */
static uint8_t  g_xfer_ok  = 0;            /* 1 = posledni HAL_SPI prenos vratil HAL_OK */
static uint8_t  g_last_rx0 = 0;            /* prvni prijaty bajt z MISO (bring-up diag) */
static fpga_meas_t s_last;                 /* posledni naparsovany DATA ramec (i nefresh/invalid) */
static uint8_t  s_last_seen = 0;           /* 1 = aspon jeden DATA ramec dorazil */

/* === Little-endian cteni === */
static uint64_t rd_le64(const uint8_t *p)
{
    uint64_t v = 0;
    for (int i = 0; i < 8; i++) v |= (uint64_t)p[i] << (8 * i);
    return v;
}
static uint32_t rd_le32(const uint8_t *p)
{
    return (uint32_t)p[0] | ((uint32_t)p[1] << 8) | ((uint32_t)p[2] << 16) | ((uint32_t)p[3] << 24);
}

/* === CRC-16/CCITT-FALSE (poly 0x1021, init 0xFFFF, no reflect, xorout 0) === */
static uint16_t crc16_ccitt(const uint8_t *d, int n)
{
    uint16_t crc = 0xFFFF;
    for (int i = 0; i < n; i++) {
        crc ^= (uint16_t)d[i] << 8;
        for (int b = 0; b < 8; b++)
            crc = (crc & 0x8000) ? (uint16_t)((crc << 1) ^ 0x1021) : (uint16_t)(crc << 1);
    }
    return crc;
}

/* === Sestaveni TX ramce === */
static void build_frame(uint8_t type, uint32_t seq, const uint8_t *payload, uint16_t plen, uint8_t *f)
{
    if (plen > 50) plen = 50;      /* klamp PRED zapisem PAYLOAD_LEN (konzistence pole vs. data) */
    memset(f, 0, FR_LEN);
    f[0] = FR_MAGIC;
    f[1] = FR_VERSION;
    f[2] = type;
    f[3] = 0;                      /* FLAGS (STM32 -> FPGA): 0 */
    f[4] = (uint8_t)(seq);
    f[5] = (uint8_t)(seq >> 8);
    f[6] = (uint8_t)(seq >> 16);
    f[7] = (uint8_t)(seq >> 24);
    f[8] = (uint8_t)(plen);
    f[9] = (uint8_t)(plen >> 8);
    /* f[10..11] RESERVED = 0 */
    if (payload && plen) memcpy(&f[FR_PAYLOAD], payload, plen);
    uint16_t crc = crc16_ccitt(f, 62);
    f[62] = (uint8_t)(crc);        /* low byte */
    f[63] = (uint8_t)(crc >> 8);   /* high byte */
}

/* === Presne us prodlevy pres DWT cyklovy citac (M7 @ SystemCoreClock).
 * NOP-busy-wait byl nespolehlivy napric -O0/-O2; DWT je deterministicky. === */
static void dwt_init(void)
{
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
    DWT->CTRL        |= DWT_CTRL_CYCCNTENA_Msk;
}
static void delay_us(uint32_t us)
{
    uint32_t start = DWT->CYCCNT;
    uint32_t ticks = us * (SystemCoreClock / 1000000u);
    while ((uint32_t)(DWT->CYCCNT - start) < ticks) { __NOP(); }
}

/* Prodlevy dle kontraktu: CS setup/hold >=1 us (davame 2), mezi ramci >=20 us
 * (FPGA potrebuje ~124 cyklu @10 MHz na slozeni noveho ramce; davame 25). */
#define FPGA_CS_GAP_US     2u
#define FPGA_FRAME_GAP_US  25u

static void cs_low(void)  { HAL_GPIO_WritePin(FPGA_CS_GPIO_Port, FPGA_CS_Pin, GPIO_PIN_RESET); }
static void cs_high(void) { HAL_GPIO_WritePin(FPGA_CS_GPIO_Port, FPGA_CS_Pin, GPIO_PIN_SET); }

/* SPI2 mutex: xfer() vola FpgaTask (poll 20 Hz) i UartTask (fpgaraw/fpgaloop).
 * Bez zamku by se dve transakce prokladaly (CS/SCK kolize -> rozbity ramec,
 * u FPGA slave rozhozene pocitani bitu). Vytvari fpga_freq_init (bezi uz pod
 * schedulerem z FpgaTasku). */
static osMutexId_t s_spi_mtx;

static bool xfer(const uint8_t *tx, uint8_t *rx)
{
    bool locked = false;
    if (s_spi_mtx != NULL && osKernelGetState() == osKernelRunning) {
        if (osMutexAcquire(s_spi_mtx, 100) != osOK) return false;
        locked = true;
    }

    cs_low();
    delay_us(FPGA_CS_GAP_US);                         /* CS low -> 1. SCK (>=1 us) */
    HAL_StatusTypeDef st = HAL_SPI_TransmitReceive(&hspi2, (uint8_t *)tx, rx, FR_LEN, 100);
    delay_us(FPGA_CS_GAP_US);                         /* posledni SCK -> CS high (>=1 us) */
    cs_high();
    delay_us(FPGA_FRAME_GAP_US);                      /* pauza mezi ramci (>=20 us) */

    if (locked) osMutexRelease(s_spi_mtx);
    return (st == HAL_OK);
}

void fpga_freq_restart(void)
{
    if (!g_init_ok) return;
    uint8_t tx[FR_LEN], rx[FR_LEN];
    build_frame(TYPE_START, 0, NULL, 0, tx);
    xfer(tx, rx);
}

bool fpga_freq_link_ok(void)
{
    return s_link_ok != 0;
}

/* Pocet ramcu se spatnym CRC od bootu (diagnostika linky). */
uint32_t fpga_freq_crc_count(void)
{
    return g_rx_crc;
}

/* "uptime od posledni CRC chyby" v sekundach (0 = zadna chyba). */
uint32_t fpga_freq_crc_last_age_s(void)
{
    if (g_rx_crc == 0) return 0;
    return (HAL_GetTick() - g_rx_crc_last_ms) / 1000u;
}

/* Akceptacni krok 1: CRC self-test. crc16("123456789") MUSI byt 0x29B1,
 * jinak nase CRC neodpovida FPGA a nesmime nic posilat. */
bool fpga_freq_crc_selftest(void)
{
    static const uint8_t v[9] = { '1','2','3','4','5','6','7','8','9' };
    uint16_t c = crc16_ccitt(v, 9);
    bool ok = (c == 0x29B1);
    printf("fpga: CRC selftest crc16(\"123456789\")=0x%04X %s\n",
           (unsigned)c, ok ? "OK" : "FAIL");
    return ok;
}

void fpga_freq_init(void)
{
    dwt_init();                  /* cyklovy citac pro presne us prodlevy */

    if (s_spi_mtx == NULL) s_spi_mtx = osMutexNew(NULL);   /* serializace xfer() */

    if (!fpga_freq_crc_selftest()) {
        /* CRC build neodpovida FPGA -> nezahajovat komunikaci (kontrakt bod 7.1) */
        printf("fpga: CRC selftest FAIL - SPI komunikace NEZAHAJENA\n");
        return;
    }

    /* CS pin (PB12) jako push-pull vystup - self-contained, nezavisle na gpio.c/IOC.
     * V IOC je PB12 jeste pod starym nazvem "SPI2_RCK" (74HC595 latch, uz nepouzity);
     * kdyby ho regen odebral, tahle konfigurace zajisti, ze CS porad funguje. */
    __HAL_RCC_GPIOB_CLK_ENABLE();
    GPIO_InitTypeDef gi = {0};
    gi.Pin   = FPGA_CS_Pin;
    gi.Mode  = GPIO_MODE_OUTPUT_PP;
    gi.Pull  = GPIO_NOPULL;
    gi.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(FPGA_CS_GPIO_Port, &gi);

