ok2haz/Frequency_Counter_FPGA/Frequency_Counter_STM32H757/CM7/Core/Src/fpga_freq.c
    cs_high();   /* CS idle (deasserted) */

    /* Zvolit prescaler tak, aby SCK <= cil (bring-up). */
    static const struct { uint32_t e, d; } P[] = {
        { SPI_BAUDRATEPRESCALER_2,   2   }, { SPI_BAUDRATEPRESCALER_4,   4   },
        { SPI_BAUDRATEPRESCALER_8,   8   }, { SPI_BAUDRATEPRESCALER_16,  16  },
        { SPI_BAUDRATEPRESCALER_32,  32  }, { SPI_BAUDRATEPRESCALER_64,  64  },
        { SPI_BAUDRATEPRESCALER_128, 128 }, { SPI_BAUDRATEPRESCALER_256, 256 },
    };
    uint32_t k = HAL_RCCEx_GetPeriphCLKFreq(RCC_PERIPHCLK_SPI123);
    uint32_t chosen = SPI_BAUDRATEPRESCALER_256, div = 256;
    for (int i = 0; i < 8; i++) {
        if (k / P[i].d <= FPGA_SCK_TARGET_HZ) { chosen = P[i].e; div = P[i].d; break; }
    }
    hspi2.Init.BaudRatePrescaler = chosen;
    /* SCK musi v klidu zustat LOW (Mode 0). S AFCNTR=DISABLE STM mezi prenosy uvolni
     * piny SCK/MOSI -> SCK plave a pull-up na FPGA ho tahne HIGH -> FPGA vidi pri CS-low
     * falesnou hranu a rozhodi pocitani bitu (RX0:FF). ENABLE = SPI drzi piny na idle
     * urovni i kdyz je vypnute (CFG2.AFCNTR=1). */
    hspi2.Init.MasterKeepIOState = SPI_MASTER_KEEP_IO_STATE_ENABLE;
    if (HAL_SPI_Init(&hspi2) != HAL_OK) {
        printf("fpga: HAL_SPI_Init FAILED\n");
        return;
    }
    g_sck_hz = (k && div) ? k / div : 0;
    printf("fpga: SPI2 kernel=%lu Hz, SCK ~%lu Hz, CS=PB12\n",
           (unsigned long)k, (unsigned long)g_sck_hz);

    g_init_ok = 1;               /* od ted smime komunikovat */

    /* Spustit kontinualni mereni */
    fpga_freq_restart();
    printf("fpga: START odeslan\n");
}

/* Naparsuje DATA payload (absolutni offsety, payload zacina na FR_PAYLOAD=12). */
/* ══════════════ Emulator FPGA ramcu (viz fpga_freq.h) ══════════════════════
 * Sklada syntetický DATA ramec VCETNE spravneho CRC, takze projde uplne stejnou
 * cestou jako ramec z draru. Zadny zvlastni rezim v `parse_data` ani nize — to
 * je smysl celeho cviceni. */
#define SIM_FAULT_NONE   0
#define SIM_FAULT_LOST   1
#define SIM_FAULT_CRC    2
#define SIM_FAULT_DIV16  3
#define SIM_FAULT_PHASE  4

static uint8_t  s_sim_on     = 0;
static double   s_sim_hz     = 0.0;
static float    s_sim_noise  = 0.0f;     /* bila slozka +-ppb */
static float    s_sim_drift  = 0.0f;     /* ppb/hodinu */
static uint8_t  s_sim_fault  = SIM_FAULT_NONE;
static uint32_t s_sim_seq    = 0;
static uint32_t s_sim_next_ms = 0;       /* kdy vyrobit DALSI mereni */
static uint64_t s_sim_ts     = 0;
static uint32_t s_sim_t0     = 0;        /* start emulace (pro drift) */
static uint32_t s_sim_rnd    = 0x12345678u;

/* Pravdepodobne nejlevnejsi rozumny generator: 32bit xorshift. Nepotrebujeme
 * kvalitni nahodnost, jen necosinusovy sum bez zavislosti na libc. */
static uint32_t sim_rand(void)
{
    uint32_t x = s_sim_rnd;
    x ^= x << 13; x ^= x >> 17; x ^= x << 5;
    s_sim_rnd = x;
    return x;
}

/* Vrati kmitocet aktualniho mereni [Hz] = nominal * (1 + (drift + sum) * 1e-9). */
static double sim_freq_hz(void)
{
    float hours = (float)(HAL_GetTick() - s_sim_t0) / 3600000.0f;
    float dev_ppb = s_sim_drift * hours;
    if (s_sim_noise > 0.0f) {
        /* uniformne v <-noise, +noise> */
        float u = (float)(sim_rand() >> 8) / (float)(1u << 24);   /* 0..1 */
        dev_ppb += (u * 2.0f - 1.0f) * s_sim_noise;
    }
    return s_sim_hz * (1.0 + (double)dev_ppb * 1e-9);
}

static void sim_put_le64(uint8_t *p, uint64_t v)
{
    for (int i = 0; i < 8; i++) p[i] = (uint8_t)(v >> (8 * i));
}

/* Naplni `f` (64 B) kompletnim DATA ramcem. `fresh` = jde o NOVE mereni. */
static void sim_build_frame(uint8_t *f, int fresh)
{
    uint8_t pl[50];
    memset(pl, 0, sizeof pl);
    memset(f, 0, FR_LEN);

    double hz = sim_freq_hz();
    /* Kontrakt: hodnota uz zahrnuje delicku, STM nenasobi. Obe odbocky nesou
     * TENTYZ kmitocet (na desce je to jeden citac, dve odbocky) — tim se testuje
     * i to, ze `fpga_freq_select` prepina podle rozsahu, ne podle rozdilu hodnot. */
    uint64_t fx = (uint64_t)(hz * 100000.0 + 0.5);
    /* Gate ~250 ms s drobnym rozptylem, jako u realneho reciprokeho mereni. */
    uint64_t gate_ns = 250000000ull + (sim_rand() % 200000u);
    uint64_t edges   = (uint64_t)(hz * (double)gate_ns / 1e9);

    sim_put_le64(pl + 0,  fx);                       /* frequency_x100000 (/4)  */
    sim_put_le64(pl + 8,  edges);                    /* edge_count              */
    sim_put_le64(pl + 16, gate_ns);                  /* gate_time_ns            */
    sim_put_le64(pl + 24, s_sim_ts);                 /* timestamp_10MHz_ticks   */
    pl[32] = 0;                                      /* channel_id              */
    pl[33] = fresh ? 0x03u : 0x01u;                  /* measurement_status V+F  */
    /* error_flags (u32 LE) na p+34, phase_status p+38, status2 p+39, freq16 p+40 */
    if (s_sim_fault == SIM_FAULT_LOST) {
        pl[34] = 0x02;                               /* bit1 SIGNAL_LOST        */
        pl[33] = 0x00;                               /* uz ne VALID             */
    }
    pl[38] = (s_sim_fault == SIM_FAULT_PHASE) ? 0xEFu : 0xFFu;   /* dira ve fine_seen */
    pl[39] = (s_sim_fault == SIM_FAULT_DIV16) ? 0x01u : 0x00u;   /* status2 bit0     */
    sim_put_le64(pl + 40, fx);                       /* freq16_x100000 (/16)    */

    f[0] = FR_MAGIC;
    f[1] = FR_VERSION;
    f[2] = TYPE_DATA;
    /* FLAGS/STATUS: FPGA hlasi VALID/FRESH tady (parse bere rx[3]). Pri
     * SIGNAL_LOST shazujeme VALID — stejne jako to dela skutecna FPGA. */
    f[3] = (s_sim_fault == SIM_FAULT_LOST)
             ? (uint8_t)ST_ACK_OK
             : (uint8_t)(ST_DATA_VALID | (fresh ? ST_DATA_FRESH : 0u) | ST_ACK_OK);
    f[4] = (uint8_t)(s_sim_seq);
    f[5] = (uint8_t)(s_sim_seq >> 8);
    f[6] = (uint8_t)(s_sim_seq >> 16);
    f[7] = (uint8_t)(s_sim_seq >> 24);
    f[8] = 50;                                       /* PAYLOAD_LEN */
    memcpy(&f[FR_PAYLOAD], pl, sizeof pl);

    uint16_t crc = crc16_ccitt(f, 62);
    if (s_sim_fault == SIM_FAULT_CRC) crc ^= 0xFFFFu;   /* schvalne spatne */
    f[62] = (uint8_t)(crc);
    f[63] = (uint8_t)(crc >> 8);
}

/* Vyrobi ramec do rx[]. Nova SEQ jen ~4x/s (realna FPGA ma gate 0,25 s), i kdyz
 * FpgaTask polluje 20x/s — jinak by emulace vyrabela 20 mereni/s a zkreslila by
 * vse, co se opira o tempo mereni. */
static void sim_produce(uint8_t *rx)
{
    uint32_t now = HAL_GetTick();
    int fresh = 0;
    if ((int32_t)(now - s_sim_next_ms) >= 0) {
        s_sim_next_ms = now + 250u;
        s_sim_seq++;
        s_sim_ts += 2500000ull;      /* 0,25 s v tikach 10 MHz */
        fresh = 1;
    }
    sim_build_frame(rx, fresh);
}

