ok2haz/Frequency_Counter_FPGA/Frequency_Counter_STM32H757/CM7/Core/Src/fpga_freq.c
void fpga_sim_set(int on, double hz, float noise_ppb, float drift_ppb_h)
{
    s_sim_on    = on ? 1u : 0u;
    if (!on) { s_sim_hz = 0.0; return; }
    if (hz < 1.0) hz = 10000000.0;                  /* default 10 MHz */
    s_sim_hz    = hz;
    s_sim_noise = (noise_ppb < 0.0f) ? 0.0f : noise_ppb;
    s_sim_drift = drift_ppb_h;
    s_sim_t0    = HAL_GetTick();
    s_sim_next_ms = s_sim_t0;
    /* SEQ zamerne NEnulujeme: `g_last_seq` uz muze byt cokoli a shodne cislo by
     * vypadalo jako "neni nove mereni". Skok kupredu je bezpecny (kontrakt
     * porovnava jen nerovnost). */
    s_sim_seq  += 1000u;
}

int    fpga_sim_active(void) { return s_sim_on ? 1 : 0; }
double fpga_sim_hz(void)     { return s_sim_on ? s_sim_hz : 0.0; }

int fpga_sim_fault(const char *what)
{
    if (what == NULL)                   return 0;
    if (strcmp(what, "none")  == 0) { s_sim_fault = SIM_FAULT_NONE;  return 1; }
    if (strcmp(what, "lost")  == 0) { s_sim_fault = SIM_FAULT_LOST;  return 1; }
    if (strcmp(what, "crc")   == 0) { s_sim_fault = SIM_FAULT_CRC;   return 1; }
    if (strcmp(what, "div16") == 0) { s_sim_fault = SIM_FAULT_DIV16; return 1; }
    if (strcmp(what, "phase") == 0) { s_sim_fault = SIM_FAULT_PHASE; return 1; }
    return 0;
}

static void parse_data(const uint8_t *rx, fpga_meas_t *m)
{
    const uint8_t *p = &rx[FR_PAYLOAD];
    m->frequency_x100000  = rd_le64(p + 0);    /* abs 12: pin28 /4   */
    m->edge_count         = rd_le64(p + 8);    /* abs 20 */
    m->gate_time_ns       = rd_le64(p + 16);   /* abs 28 */
    m->timestamp_ticks    = rd_le64(p + 24);   /* abs 36 */
    m->channel_id         = p[32];             /* abs 44 */
    m->measurement_status = p[33];             /* abs 45 */
    m->error_flags        = rd_le32(p + 34);   /* abs 46 */
    m->phase_status       = p[38];             /* abs 50 */
    m->status2            = p[39];             /* abs 51 */
    m->freq16_x100000     = rd_le64(p + 40);   /* abs 52: pin27 /16  */
    m->sequence           = rd_le32(&rx[4]);
    m->status_flags       = rx[3];
}

bool fpga_freq_poll(fpga_meas_t *out)
{
    static uint8_t tx[FR_LEN], rx[FR_LEN];

    if (!g_init_ok) return false;   /* selftest neprosel -> neposilat nic (kontrakt 7.1) */

    /* ⚠️ JEDINY rozdil emulace: odkud se vezme obsah `rx`. VSE nize (MAGIC, CRC,
     * TYPE, parse_data, latch, VALID/FRESH/SEQ) bezi bez zmeny — prave proto je
     * emulace uzitecna. Na SPI se pritom NESAHA, takze bezici emulace nemuze
     * rozhodit pripadnou skutecnou FPGA na sbernici. */
    if (s_sim_on) {
        sim_produce(rx);
        g_xfer_ok = 1;
    } else {
        /* ACK posledni potvrzene seq (potvrdi predchozi + vyclockuje aktualni ramec) */
        build_frame(TYPE_ACK, g_last_seq, NULL, 0, tx);
        if (!xfer(tx, rx)) { g_xfer_ok = 0; s_link_ok = 0; return false; }
        g_xfer_ok = 1;
    }
    g_last_rx0 = rx[0];                                /* diagnostika: co prislo na MISO */

    if (rx[0] != FR_MAGIC) { s_link_ok = 0; return false; }

    uint16_t crc_calc = crc16_ccitt(rx, 62);
    uint16_t crc_rx   = (uint16_t)rx[62] | ((uint16_t)rx[63] << 8);
    if (crc_calc != crc_rx) { g_rx_crc++; g_rx_crc_last_ms = HAL_GetTick(); s_link_ok = 0; return false; }

    s_link_ok = 1;   /* platny ramec dorazil -> link je ziva (i kdyz neni nove mereni) */

    uint8_t type   = rx[2];
    uint8_t status = rx[3];
    if (type != TYPE_DATA) return false;

    /* Latch KAZDEHO platneho DATA ramce (i kdyz neni fresh/valid) -> STM vidi
     * error_flags/SIGNAL_LOST/phase_status i pri ztrate signalu (kdy VALID=0).
     * Parse do lokalu + kopie pod kratkym IRQ-off: s_last cte i UiTask pres
     * fpga_freq_get_last() (okno Citac) — bez toho by mohl videt roztrzeny
     * ramec (64 B, vic nez jedna 32bit operace). */
    fpga_meas_t tmp;
    parse_data(rx, &tmp);
    {
        uint32_t pm = __get_PRIMASK();
        __disable_irq();
        s_last = tmp;
        s_last_seen = 1;
        __set_PRIMASK(pm);
    }

    if (!(status & ST_DATA_VALID) || !(status & ST_DATA_FRESH)) return false;
    if (s_last.sequence == g_last_seq) return false;   /* neni nove */

    if (out) *out = s_last;
    g_last_seq = s_last.sequence;                       /* dalsi ACK potvrdi tuto seq */
    return true;
}

bool fpga_freq_signal_lost(void)
{
    return s_last_seen && (s_last.error_flags & FPGA_ERR_SIGNAL_LOST);
}

bool fpga_freq_get_last(fpga_meas_t *out)
{
    /* Kratky IRQ-off (~64 B memcpy) = vzajemne vylouceni s latchem ve
     * fpga_freq_poll() bez zavislosti na FreeRTOS API (drzi to driver cisty). */
    uint32_t pm = __get_PRIMASK();
    __disable_irq();
    uint8_t seen = s_last_seen;
    if (seen && out) *out = s_last;
    __set_PRIMASK(pm);
    return seen != 0;
}

/* Prahy prepnuti zdroje S HYSTEREZI (x1e5): nahoru na /16 nad ~380 MHz, zpet na
 * /4 az pod ~360 MHz. Bez hystereze mereni sumici kolem prahu preskakovalo mezi
 * zdroji s ruznym rozlisenim (posledni cislice "blikaly" mezi dvema hodnotami). */
#define FPGA_SEL_UP_X1E5    38000000000000ULL   /* 380 MHz: /4 -> /16 */
#define FPGA_SEL_DOWN_X1E5  36000000000000ULL   /* 360 MHz: /16 -> /4 */

/* Ciste jadro volby zdroje (bez stavu -> unit-testovatelne v selftestu).
 * Vraci novy use16 pro dany predchozi stav + mereni. */
int fpga_freq_select_core(int use16, const fpga_meas_t *m)
{
    bool f4_err = (m->error_flags & FPGA_ERR_MEAS) != 0;
    bool f16_ok = !(m->status2 & FPGA_ST2_DIV16_ERR);

    if (use16) {
        /* zpet na /4 jen kdyz /4 meri a je bezpecne pod prahem (hystereze),
         * nebo kdyz /16 sam chybuje a /4 je pouzitelny */
        if (!f4_err && (m->frequency_x100000 < FPGA_SEL_DOWN_X1E5 || !f16_ok))
            use16 = 0;
    } else {
        if ((f4_err || m->frequency_x100000 >= FPGA_SEL_UP_X1E5) && f16_ok)
            use16 = 1;
    }
    return use16;
}

/* ── Overeni nasobitele reciproke dvojice (viz .h) ────────────────────────────
 * 🔴 HISTORIE: hi-res dopocet nasobil `edge_count` NAPEVNO ctyrmi (predpoklad,
 * ze je to pocet period vetve /4). Emulator `fpgasim` ale pocita periody
 * NEDELENEHO signalu, takze `fpgasim on 10000000` ukazoval 40 MHz (opraveno
 * commitem a6c0128). Tahle funkce je od te doby JEDINY zdroj pravdy o
 * nasobiteli — kdo si ho odvodi sam, tu chybu si zopakuje. */
uint32_t fpga_freq_hires_mul(uint64_t x100000, uint64_t edges, uint64_t gate_ns)
{
    if (gate_ns == 0u || edges == 0u) return 0u;
    uint64_t ref = x100000 / 100000ull;                  /* cele Hz, autoritativne z ramce */
    if (ref == 0u) return 0u;
    static const uint32_t MUL[] = { 1u, 4u, 16u };
    for (unsigned i = 0; i < sizeof MUL / sizeof MUL[0]; i++) {
        if (edges > 4000000000ull / MUL[i]) continue;    /* pojistka proti preteceni */
        uint64_t v = (edges * MUL[i] * 1000000000ull) / gate_ns;
        uint64_t d = (v > ref) ? (v - ref) : (ref - v);
        if (d * 1000ull <= ref) return MUL[i];           /* shoda do 0,1 % */
    }
    return 0u;                                           /* nesedi zadny -> hi-res nepouzivat */
}

