ok2haz/Frequency_Counter_FPGA/Frequency_Counter_STM32H757/CM7/Core/Src/fpga_freq.c
uint64_t fpga_freq_hires_uhz(uint64_t x100000, uint64_t edges, uint64_t gate_ns)
{
    uint32_t mul = fpga_freq_hires_mul(x100000, edges, gate_ns);
    if (mul == 0u) return x100000 * 10ull;               /* fallback: x1e5 -> µHz je x10 */
    /* Dlouhe deleni na 6 desetin (µHz). Nasobit napred (num × 1e6) NELZE —
     * pri 10 MHz uz to je ~1e22 >> 1,8e19. */
    uint64_t num = edges * mul * 1000000000ull;          /* <= 4e18, viz guard vyse */
    uint64_t v = num / gate_ns, rem = num % gate_ns;
    for (int i = 0; i < 6; i++) { rem *= 10u; v = v * 10u + rem / gate_ns; rem %= gate_ns; }
    return v;
}

uint64_t fpga_freq_select(const fpga_meas_t *m, int *used16)
{
    /* /4 ma nejlepsi rozliseni; nad ~380 MHz je pin28 (/4 -> ~95 MHz) u stropu -> /16.
     * Sticky stav (jediny konzument = FpgaTask): drzi zvoleny zdroj, prepina jen
     * pri prekroceni prahu s hysterezi nebo pri chybe aktivniho zdroje. */
    static int s_use16 = 0;
    s_use16 = fpga_freq_select_core(s_use16, m);
    if (used16) *used16 = s_use16;
    return s_use16 ? m->freq16_x100000 : m->frequency_x100000;
}

/* Selftest hystereze /4<->/16 na syntetickych ramcich (cista logika, nemeni
 * runtime stav FpgaTasku). Soucast UART "selftest". */
bool fpga_freq_select_selftest(void)
{
    fpga_meas_t m;
    memset(&m, 0, sizeof m);
    int u = 0, ok = 1;
    #define SEL_MHZ(x) ((uint64_t)(x) * 1000000ULL * 100000ULL)

    m.frequency_x100000 = SEL_MHZ(100);                      /* 100 MHz -> /4 */
    u = fpga_freq_select_core(u, &m); ok &= (u == 0);
    m.frequency_x100000 = SEL_MHZ(390);                      /* 390 MHz -> /16 */
    u = fpga_freq_select_core(u, &m); ok &= (u == 1);
    m.frequency_x100000 = SEL_MHZ(370);                      /* 370: hystereze -> drzi /16 */
    u = fpga_freq_select_core(u, &m); ok &= (u == 1);
    m.frequency_x100000 = SEL_MHZ(350);                      /* 350: pod 360 -> zpet /4 */
    u = fpga_freq_select_core(u, &m); ok &= (u == 0);
    m.frequency_x100000 = SEL_MHZ(370);                      /* 370 z /4 strany -> drzi /4 */
    u = fpga_freq_select_core(u, &m); ok &= (u == 0);
    m.error_flags = FPGA_ERR_MEAS;                           /* /4 chybuje -> /16 */
    u = fpga_freq_select_core(u, &m); ok &= (u == 1);
    m.error_flags = 0; m.status2 = FPGA_ST2_DIV16_ERR;       /* /16 chybuje -> zpet /4 */
    u = fpga_freq_select_core(u, &m); ok &= (u == 0);
    m.frequency_x100000 = SEL_MHZ(500);                      /* vysoko, ale /16 vadny -> drzi /4 */
    u = fpga_freq_select_core(u, &m); ok &= (u == 0);

    #undef SEL_MHZ
    printf("fpga: select hystereze selftest %s\n", ok ? "OK" : "FAIL");
    return ok != 0;
}

void fpga_freq_format_val(uint64_t v, char *buf, int buflen)
{
    uint64_t ipart = v / 100000ULL;
    uint32_t frac  = (uint32_t)(v % 100000ULL);      /* 5 desetinnych mist */

    /* Celociselna cast s teckou po trojicich (cesky styl) */
    char rev[24];
    int n = 0;
    if (ipart == 0) {
        rev[n++] = '0';
    } else {
        while (ipart > 0 && n < (int)sizeof(rev)) { rev[n++] = (char)('0' + (ipart % 10)); ipart /= 10; }
    }
    char grp[40];
    int gi = 0;
    for (int i = 0; i < n && gi < (int)sizeof(grp) - 1; i++) {
        grp[gi++] = rev[n - 1 - i];
        int remaining = n - 1 - i;
        if (remaining > 0 && (remaining % 3) == 0 && gi < (int)sizeof(grp) - 1) grp[gi++] = '.';
    }
    grp[gi] = '\0';

    snprintf(buf, buflen, "%s,%05luHz", grp, (unsigned long)frac);
}

/* uint64 -> decimal string (nano-printf neumi %llu) */
static int u64_to_str(uint64_t v, char *out)
{
    char rev[24];
    int n = 0;
    if (v == 0) { out[0] = '0'; out[1] = '\0'; return 1; }
    while (v > 0 && n < (int)sizeof(rev)) { rev[n++] = (char)('0' + (v % 10)); v /= 10; }
    for (int i = 0; i < n; i++) out[i] = rev[n - 1 - i];
    out[n] = '\0';
    return n;
}

void fpga_freq_format_info(const fpga_meas_t *m, int use16, char *buf, int buflen)
{
    char g[24];
    u64_to_str(m->gate_time_ns, g);
    uint8_t present = m->phase_status & 0x0F;          /* zive faze (ideal 0xF) */
    uint8_t fine    = (m->phase_status >> 4) & 0x0F;   /* videne jemne kody (ideal 0xF) */

    /* chybovy tag (priorita: ztrata > overflow > div chyby) */
    const char *etag = "";
    if      (m->error_flags & FPGA_ERR_SIGNAL_LOST) etag = " LOST";
    else if (m->error_flags & FPGA_ERR_OVERFLOW)    etag = " OVF";
    else if (m->error_flags & FPGA_ERR_MEAS)        etag = " E/4";
    else if (m->status2     & FPGA_ST2_DIV16_ERR)   etag = " E/16";

    /* ⚠️ "SIM" JAKO PRVNI — info radek je videt na hlavni obrazovce i v diagnostice,
     * takze emulovana data nesmi jit zamenit za merena ani letmym pohledem. */
    snprintf(buf, buflen, "%s%s PH:%X/%X GATE:%sNS SEQ:%lu%s",
             s_sim_on ? "SIM " : "",
             use16 ? "/16" : "/4", present, fine, g, (unsigned long)m->sequence, etag);
}

bool fpga_freq_raw_xfer(uint8_t *rx64)
{
    if (!g_init_ok) return false;
    uint8_t tx[FR_LEN];
    build_frame(TYPE_ACK, g_last_seq, NULL, 0, tx);   /* posleme platny ACK ramec */
    return xfer(tx, rx64);
}

void fpga_freq_format_status(char *buf, int buflen)
{
    uint32_t mhz_i = g_sck_hz / 1000000u;
    uint32_t mhz_f = (g_sck_hz % 1000000u) / 10000u;   /* 2 desetinna mista MHz */

    if (!s_link_ok) {
        /* bring-up diagnostika: prosel HW prenos? co je na MISO?
         * HAL:ERR  -> SPI periferie/piny/clock (HAL_SPI_TransmitReceive selhal)
         * RX0:FF   -> MISO ctene jako 1 (FPGA nebudi / nezapojeno / nedokonfig.)
         * RX0:00   -> MISO ctene jako 0 (totez, opacny klid)
         * RX0:A5   -> MAGIC OK ale CRC/typ selhal -> viz CRC pocitadlo */
        snprintf(buf, buflen, "SPI %lu.%02luMHZ NOLINK HAL:%s RX0:%02X CRC:%lu",
                 (unsigned long)mhz_i, (unsigned long)mhz_f,
                 g_xfer_ok ? "OK" : "ERR", (unsigned)g_last_rx0,
                 (unsigned long)g_rx_crc);
        return;
    }

    char seq[16];
    if (g_last_seq == 0xFFFFFFFFu) { seq[0] = '-'; seq[1] = '\0'; }
    else snprintf(seq, sizeof(seq), "%lu", (unsigned long)g_last_seq);

    snprintf(buf, buflen, "SPI %lu.%02luMHZ LINK:OK SEQ:%s CRC:%lu",
             (unsigned long)mhz_i, (unsigned long)mhz_f,
             seq, (unsigned long)g_rx_crc);
}
